Enterprise_Serivces/Prod/SilverGroup1/CSLAllSparkOrderService/result1/Iteration1/t5_RequestBody.txt

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing"><soap:Header><CorrelationID xmlns="http://www.gamestop.com/CSL/AllSparkOrder/V1.0">a4581bc9-1b56-4353-b9e8-d0533aa80400</CorrelationID><MachineName xmlns="http://www.gamestop.com/CSL/AllSparkOrder/V1.0">test</MachineName><wsa:Action>http://www.gamestop.com/CSL/AllSparkOrder/V1.0/OrderService_v1/ValidateAndSubmitOrder</wsa:Action><wsa:MessageID>uuid:4031958f-4273-4406-91c8-7b69a5b730c8</wsa:MessageID><wsa:ReplyTo><wsa:Address>http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsa:To>http://cslallsparkorderserviceqa1.testgs.pvt/OrderService.svc</wsa:To></soap:Header><soap:Body><ValidateAndSubmitOrderRequest xmlns="http://www.gamestop.com/CSL/AllSparkOrder/V1.0"><CatalogID>1</CatalogID><IsProductActiveFromPartner>true</IsProductActiveFromPartner><IsProductActiveFromProvider>true</IsProductActiveFromProvider><IsProductAvailableForPresell>true</IsProductAvailableForPresell><IsProductReleased>true</IsProductReleased><OrderRequestGUID>0bdd7b7c-daac-4323-80fc-978bbce40dab</OrderRequestGUID><PartnerID>2</PartnerID><PartnerKey>TEST-US</PartnerKey></ValidateAndSubmitOrderRequest></soap:Body></soap:Envelope>